app/controllers/tweets_controller.rb

  def create
    # simulate latency

    @tweet = current_user.tweets.build(tweet_params)

    if @tweet.save
---
INSERT INTO "tweets" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "I have a new perfume!"], ["created_at", "2014-11-15 00:44:56.915421"], ["updated_at", "2014-11-15 00:44:56.915421"], ["user_id", 8]]